// Бодит = Тоо 
// Хуурмаг = Тоо
// Радиан = Тоо
// Комплекс = [Бодит, Хуурмаг]

// Комплекс нэмэх
// Ор: a: Комплекс
//     b: Комплекс
// Гар: Комплекс
const cadd = (a, b) => [a[0] + b[0], a[1] + b[1]];

// Комплекс хасах
// Ор: a: Комплекс
//     b: Комплекс
// Гар: Комплекс
const csub = (a, b) => [a[0] - b[0], a[1] - b[1]];

// Комплекс үржих
// Ор: a: Комплекс
//     b: Комплекс
// Гар: Комплекс
const cmul = (a, b) => [
    a[0]*b[0] - a[1]*b[1],
    a[0]*b[1] + a[1]*b[0]
];

// Комплекс экспоненциал
// Ор: phi: Радиан
// Гар: Комплекс
const cexp = (phi) => [
    parseFloat(Math.cos(phi).toFixed(10)),
    parseFloat(Math.sin(phi).toFixed(10))
];

// Комплекс амплитуд
// Ор: c: Комплекс
// Гар: Комплекс
const camp = (c) => Math.sqrt(c[0]**2 + c[1]**2);

// Комплекс солих (Ямар нэртэйг нь мэдэхгүй юм, ямартай ч комплекс тооны бодит болон хуурмаг утгуудыг хооронд нь солино)
// Ор: c: Комплекс
// Гар: Комплекс
const cswap = (c) => [c[1], c[0]];

// Комплекс нормалчлал
// Ор: c: Комплекс
//     n: Тоо
// Гар: Комплекс
const cnorm = (c, n) => [c[0]/n, c[1]/n];

// Тэмдэгтэй комплекс амплитуд
// Ор: c: Комплекс
// Гар: Тоо
const scamp = (c) => c[0]/Math.abs(c[0]) * Math.sqrt(c[0]**2 + c[1]**2);

// Хурдан фурье хувиргалт
// Ор: x: [Комплекс|Тоо]
// Гар: [Комплекс]
const FFT = (x) => {
    let N = x.length;

    // рекурс функцийн эхлэл
    if (N > 1) {
        // оролтыг тэгс сондгойгоор нь ангилах
        let even = [];
        let odd = [];

        for (let i=0; i<parseInt(N/2); i+=1) {
            even[i] = x[i*2];
            odd[i] = x[i*2+1];
        }

        // ангилсан оролт бүр дээр FFT функцийг дахин хэрэгжүүлэх
        even = FFT(even);
        odd = FFT(odd);

        // үндсэн тооцоолол
        for (let k=0; k<parseInt(N/2); k+=1) {
            let t = even[k];
            let exp = cexp(-2*Math.PI*k/N);
            even[k] = cadd(t, cmul(exp, odd[k]));
            odd[k] = csub(t, cmul(exp, odd[k]));
        }

        // тэгш сондгойгоор ангилсан үр дүнгүүдийг нэгтгээд буцаах
        return [...even, ...odd];
    } else {
        // рекурсын буцах цэг
        // оролтыг комплекс тоо байвал шууд буцаах, үгүй бол комплекс тоо болгоод буцаах
        if (Array.isArray(x[0])) {
            return [x[0]];
        } else {
            return [[x[0], 0]];
        }
    }
}

// Урвуу хурдан фурье хувиргалт
// Ор: x: [Комплекс]
// Гар: [Комплекс]
const IFFT = (x) => FFT(x.map(cswap)).map(cswap).map((c) => cnorm(c, x.length));

// Амплитудууд
// Ор: x: [Комплекс]
// Гар: [Комплекс]
const amps = (x) => x.map(camp);

// Тэмдэгтэй амплитудууд
// Ор: x: [Комплекс]
// Гар: [Тоо]
const samps = (x) => x.map(scamp);

// Давтамжууд 
// Ор: x: [Комплекс]
// Гар: [Тоо]
const freqs = (x) => x.slice(0, x.length).map((c) => camp(c)*2);

// node.js дээр модул болгож дуудсан үед буцаах функцууд
if (typeof exports !== 'undefined') {
    exports.FFT = FFT;
    exports.FFT = IFFT;
    exports.amps = amps;
    exports.samps = samps;
    exports.freqs = freqs;
}

// жишээ оролтууд
// const s = [0, 1, 0, -1];
// const s = [1, 1, 1, 1, 0, 0, 0, 0];
// const s = [0, 0.707, 1, 0.707, 0, -0.707, -1, -0.707];
// const s = [1, 0, -1, -2, -3, -2, -3, -4, -3, -4];

// console.log(FFT(s));